Layer (type)                 Output Shape              Param #  
===================================================
Encoder (Model)        (None, 20)                6890      
_________________________________________________________________
Decoder (Model)            (None, 15, 38)            12836    
===================================================
Total params: 19,726
Trainable params: 19,666
Non-trainable params: 60
_________________________________________________________________