_________________________________________________________________
Layer (type)                 Output Shape              Param #   
===================================================
dense_1 (Dense)              (None, 15)                225       
_________________________________________________________________
batch_normalization_1 (Batch (None, 15)                60        
_________________________________________________________________
dropout_1 (Dropout)          (None, 15)                0         
_________________________________________________________________
activation_1 (Activation)    (None, 15)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 7)                 105       
_________________________________________________________________
batch_normalization_2 (Batch (None, 7)                 28        
_________________________________________________________________
dropout_2 (Dropout)          (None, 7)                 0         
_________________________________________________________________
activation_2 (Activation)    (None, 7)                 0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 7         
_________________________________________________________________
batch_normalization_3 (Batch (None, 1)                 4         
_________________________________________________________________
dropout_3 (Dropout)          (None, 1)                 0         
_________________________________________________________________
activation_3 (Activation)    (None, 1)                 0         
===================================================
Total params: 429
Trainable params: 383
Non-trainable params: 46
_________________________________________________________________